// TeamProject.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//


//전투 - 한칸씩 이동,
//몬스터 - 랜덤이동 + 탐색범위(탐지시 플레이어 추적)
//이동 - 키보드나 넘버패드입력으로 단칸이동방식
//아이템 - 물약(랜덤 이동 물약), 무기
//- 도전 - 버프, 디버프(독, 출혈)
//- 배낭 패시브아이템 장신구
//맵 - 몬스터, 구조물(벽), 맵(500 * 500), 탈출계단(생성 로직)


#include <iostream>

int main()
{
    std::cout << "할로월드!\n";
}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
